WF/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.СписокНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

WF/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокМатериалов</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.СписокНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокУслуги</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.СписокНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WF/src/Documents/ПроизводствоПродукции/ПроизводствоПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводствоПродукции</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.СписокНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокМатериалов</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.СписокНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WF/src/AccumulationRegisters/ОстаткиНоменклатуры/ManagerModule.bsl
Функция ПроверитьОтрицательныеОстатки(СсылкаРН, ДатаОтбора, Склад) Экспорт
	
	ГраницаОтбора = Новый Граница(ДатаОтбора, ВидГраницы.Включая); 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			&ДатаОтбора,
		|			Склад=&СкладОтбора 
		|			И Номенклатура В
		|				(ВЫБРАТЬ
		|					РасходнаяНакладнаяСписокМатериалов.Материал КАК Материал
		|				ИЗ
		|					Документ.РасходнаяНакладная.СписокМатериалов КАК РасходнаяНакладнаяСписокМатериалов
		|				ГДЕ
		|					РасходнаяНакладнаяСписокМатериалов.Ссылка = &СсылкаРН)) КАК ОстаткиНоменклатурыОстатки
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаОтбора", ГраницаОтбора);
	Запрос.УстановитьПараметр("СсылкаРН", СсылкаРН);
	Запрос.УстановитьПараметр("СкладОтбора", Склад);	
	РезультатЗапроса = Запрос.Выполнить();

	Если Результатзапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаВывода = СтрШаблон("Не хватает товара ""%1"" в количетсве %2шт.",
		ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.КоличествоОстаток);
		Сообщить (СтрокаВывода);
	КонецЦикла; 
	Возврат Истина;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	

КонецФункции // ПроверитьОтрицательныеОстатки() 


Функция ПроверитьОтрицательныеОстаткиСырья(СсылкаПТ, ДатаОтбора,Склад) Экспорт
	ГраницаОтбора = Новый Граница(ДатаОтбора, ВидГраницы.Включая); 
	Запрос = Новый Запрос;
	Запрос.Текст = 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			&ДатаОтбора,
		|			Склад = &СкладОтбора
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						ПроизводствоПродукцииСписокМатериалов.Материал КАК Материал
		|					ИЗ
		|						Документ.ПроизводствоПродукции.СписокМатериалов КАК ПроизводствоПродукцииСписокМатериалов
		|					ГДЕ
		|						ПроизводствоПродукцииСписокМатериалов.Ссылка = &СсылкаПТ)) КАК ОстаткиНоменклатурыОстатки
		|ГДЕ
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("ДатаОтбора", ДатаОтбора);
	Запрос.УстановитьПараметр("СсылкаПТ", СсылкаПТ);
	Запрос.УстановитьПараметр("СкладОтбора", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Результатзапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаВывода = СтрШаблон("Не хватает товара ""%1"" в количетсве %2шт.",
		ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.КоличествоОстаток);
		Сообщить (СтрокаВывода);
	КонецЦикла;
	Возврат Истина;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


	

КонецФункции // ПроверитьОтрицательныеОстатки()
